modded_vae(
  (encoder): Sequential(
    (0): Linear(in_features=10000, out_features=128, bias=True)
    (1): Dropout(p=0.15, inplace=False)
    (2): ReLU()
  )
  (fc_mu): Linear(in_features=128, out_features=12, bias=True)
  (fc_logvar): Linear(in_features=128, out_features=12, bias=True)
  (decoder): Sequential(
    (0): Linear(in_features=12, out_features=128, bias=True)
    (1): Softplus(beta=1, threshold=20)
  )
  (fc_recon): Linear(in_features=128, out_features=10000, bias=True)
)
